 <p> يتكون الموقع من الصفحة الرئسية التي تحتوي
     على عرض لكتب و اضافة الى السلة
     و اضافة و عرض التعليقات و الاسئلة الشائعة
     و تحتوي على زر الذهاب الى السلة و تسجيل دخول او انشاء حساب
     ويحتوي الموقع على الداشبورد الذي يحتوي صفحة عرض المنتجات
     و الأقسام واضافة الكتب و الاقسام و الحذف و التعديل
     وصفحة عرض الطلبات و ارشيف المبيعات الذي
     يحتوي على معلومات المنتجات المباعه و الشخص المشتري
 </p>

 <p>أماكن تواجد شروط الأختبار 👇 مع العلم توجد ايضا في صفحات اخرى</p>

 1-<a href="index2.blade.php"></a>في صفحة Tailwind الشرط الاول واجهه باستخدام
 2-<a href="Dashboard.blade.php">الشرط الثاني داشبورد</a>
 3-<a href="Dashboard.blade.php">الشرط الثالث العرض و الحذف و التعديل و البحث في </a>

 ___<a href="add_book.blade.php">
     الشرط الثالث الاضافة في صفحة</a>
 4-<a href="api.php  && ApiAdvertisementsController">الشرط الرابع API
 </a>
 5-<a href="index2.blade.php">الشرط الخامس خاصية المزيد صفحة </a>
 6-<a href="Dashboard.blade.php">الشرط السادس خاصية في صفحةpagination</a>
 7- <a href="">الشرط السابع تسجيل دخول لا يستطيع الدخول الى الداشبورد الا بتسجيل الدخول </a>
 8-<a href="">رفع الموقع </a>